trade_exp/src/InformationRegisters/ГлобальныеЗоныПоЗонамДоставкиДоКлиента/ГлобальныеЗоныПоЗонамДоставкиДоКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ba84a934-5147-4e17-a640-f03e0ee52475">
  <name>ГлобальныеЗоныПоЗонамДоставкиДоКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="1e671c52-19b1-44da-b2c0-1c9a3d85b697">
    <name>ГлобальнаяЗона</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="efbabf54-67b8-44a1-b22b-eee14fa0a01a">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2969abae-f77e-47dc-8bcd-30be27249508">
    <name>Зона</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/СтоимостьДоставкиПоЗонам/СтоимостьДоставкиПоЗонам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="04365a5f-dbee-4cc9-8016-fd62e5a5668c">
  <name>СтоимостьДоставкиПоЗонам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="739920b6-45aa-4908-9007-91e9161057e1">
    <name>СтоимостьДляВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="17627933-0e80-46f6-a773-4b73250d4deb">
    <name>МинимальнаяСтоимость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="a246d299-18dd-4335-b2e7-341fe647d335">
    <name>СтоимостьДляКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="d757bb38-0f12-4aa9-895e-f03e8e33eb7c">
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b390139b-5806-49e2-ac4b-ff8c41c466c4">
    <name>Тариф</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="72cf1185-3d87-46d3-a65f-5a69b3f4264a">
    <name>Филиал</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/ВидыДоставокДоКлиента/ВидыДоставокДоКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВидыДоставокДоКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b4cc6bd2-b207-434d-b027-c3ef416c447c">
    <name>Розничная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8cebbe69-bf66-4554-90d5-9fe9e46e6dbf">
    <name>СборнаяОРК</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4da8f5b7-705c-495c-976b-5d4823a1f879">
    <name>Внутренняя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e3544ba3-ce9f-46e6-9877-fa2b4b9656af">
    <name>ДистрибуцияСборныеГрузы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ЗоныДоставкиКлиента/ЗоныДоставкиКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b8c30312-673a-4fe8-9f16-01b90987d9a1">
  <name>ЗоныДоставкиКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="ff2174d2-fdda-45ef-8a82-95c51e0d558d">
    <name>Зона1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="aaaec6fa-5d47-4ce3-8178-e4dc07d3082c">
    <name>Зона2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/ЗоныДоставкиДоКлиента/ЗоныДоставкиДоКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗоныДоставкиДоКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="f591c817-4a4d-4a2e-be73-bead6020921e">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cb38297d-53a0-4f5f-a593-6b2e430348fb">
    <name>Координаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="44fa4d92-146d-40e4-96e7-9c5d37f4443e">
    <name>Описание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d65f49c3-36ac-4803-82e8-5b5c3d5bb1f5">
    <name>Цвет</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a0cfe55c-3dbb-4f9f-bb7f-d66c7962719b">
    <name>ВидДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1771b270-9013-484a-a6f9-eb9eee6e2077">
    <name>ГрузоподъемностьВТоннах</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="00a3e9d0-9d8e-430c-b9b7-c9703aa1add5">
    <name>МаксимальнаяДлинаГруза</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="40db4f7f-dd30-4017-86c5-af1374db9aec">
    <name>ГлобальнаяЗона</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Catalogs/ИнтервалыДоставки/ИнтервалыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="790f8dff-28d5-46ce-87ec-875605f8573b">
  <name>ИнтервалыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="ababf069-c0c8-476d-965c-81e896b42038">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="11aa7568-4f6b-4d95-b77a-6648de990a0e">
    <name>ВремяС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="177bd090-bd38-4812-8606-8c6dacceb3d4">
    <name>ВремяПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5f6ddd6a-9ce2-4e89-8324-896f2667fe88">
    <name>КоличествоДоставок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="db6eb09f-e9a5-44cd-81d1-884dd38e2c6d">
    <name>ДеньНедели</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c420361e-1ec9-4179-8056-9dc57f142971">
    <name>ИнтервалЗакрытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4bc74913-8bb1-4d8e-914e-6bdfc8c8689b">
    <name>ВидДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a1d18bc9-dc6c-4e19-a673-a4c6fc2fb79c">
    <name>МксКолДоставокСРазгрузкой</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="55456ee3-7e27-4795-a7bb-216c440e183a">
    <name>НаименованиеНаСайте</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bab7a7d5-47d2-4e3d-b16c-7879686d51c9">
    <name>ЗакрыватьСКонцаИнтервала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf3cea7f-a8c0-450d-a1e0-1af4e3c11936">
    <name>ЭкспрессДоставка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e8ee9426-0e7f-4e38-84d1-1a7a80e9e783">
    <name>ЗакрытиеИнтервалаПоРазгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1e88e37e-f9ed-4160-8573-4f3dd23fd818">
    <name>Тип</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d4ba175c-5e65-40ed-8e54-fe33435b3ade">
    <name>СМС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="63b6364f-bee0-4dc6-8d83-5ce2b2ad85c2">
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ab4e1dc3-002e-4ec2-8419-e1b89bd1101e">
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="61515652-c89c-4de0-950d-034f7fc11df3">
    <name>КоличествоДней</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/HTTPServices/Логистика/Module.bsl
#Область ВходящиеHTTPЗапросы

Функция getDuty(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);  
	
	ПараметрыВходногоЗапроса = ИнтеграцияREST.ПолучитьПараметрыHTTPЗапроса(Запрос);
	
	Попытка                               
	
		ДатаДежурства = Запрос.ПараметрыЗапроса.Получить("date");
		
		ДатаДежурства = ?(ЗначениеЗаполнено(ДатаДежурства), 
			Дата(Сред(ДатаДежурства, 7, 4), Сред(ДатаДежурства, 4, 2), Лев(ДатаДежурства, 2)), 
			ТекущаяДатаСеанса());
		
		ГрафикДежурства = ПолучитьГрафикНаДату(ДатаДежурства);
		
		Возврат
			?(ЗначениеЗаполнено(ГрафикДежурства), 
				ЗаписатьНТТPОтвет(ПараметрыВходногоЗапроса, ГрафикДежурства),
				ЗаписатьHTTPОшибку(ПараметрыВходногоЗапроса, СтрШаблон("График дежурств на %1 не определен", Формат(ДатаДежурства, "ДФ=dd.MM.yyyy;"))));  
	
	Исключение
		Возврат ЗаписатьHTTPОшибку(ПараметрыВходногоЗапроса, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецФункции

Функция getDeliveryVariants(Запрос) 
	
	УстановитьПривилегированныйРежим(Истина);  
	
	Попытка
		ПараметрыВходногоЗапроса = ИнтеграцияREST.ПолучитьПараметрыHTTPЗапроса(Запрос);   
		
		ВходныеДанные = ИнтеграцияREST.ПолучитьТелоHTTPЗапроса(Запрос.ПолучитьТелоКакСтроку("UTF-8"));
		Если Не ВходныеДанные.Результат Тогда
			Возврат ЗаписатьHTTPОшибку(ПараметрыВходногоЗапроса, ВходныеДанные.Тело);
		КонецЕсли;
		
		ВходныеДанныеСтруктура = ДанныеЗапросаgetDeliveryVariants(ВходныеДанные.Тело);     
		Если Не ВходныеДанныеСтруктура.Результат Тогда
			Возврат ЗаписатьHTTPОшибку(ПараметрыВходногоЗапроса, ВходныеДанныеСтруктура.ДанныеЗапроса);
		КонецЕсли;              
		
		ПолучениеТарифовИнтервалов = ПолучитьТарифыИнтервалыДоставки(ВходныеДанныеСтруктура.ДанныеЗапроса);
			
		Если ПолучениеТарифовИнтервалов.Результат Тогда                                         
			Возврат ЗаписатьНТТPОтвет(ПараметрыВходногоЗапроса, ПолучениеТарифовИнтервалов);    
		Иначе                           
			Возврат ЗаписатьHTTPОшибку(ПараметрыВходногоЗапроса, ПолучениеТарифовИнтервалов.Сообщение);			
		КонецЕсли;
	
	Исключение
		Возврат ЗаписатьHTTPОшибку(ПараметрыВходногоЗапроса, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));			
	КонецПопытки;	 
	
КонецФункции

#КонецОбласти

#Область ДействияHTTPЗапросы

Функция ЗаписатьНТТPОтвет(ПараметрыВходногоЗапроса, РезультатЗапроса)   
	
	Ответ = Новый HTTPСервисОтвет(200);   
	Ответ.Заголовки = УстановитьHTTPЗаголовки();
	
	ЗаписьJSON = Новый ЗаписьJSON;   
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);

	ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("error");
		ЗаписьJSON.ЗаписатьЗначение(Ложь);
		
		ЗаписатьHTTPГрафикДежурств(ПараметрыВходногоЗапроса, ЗаписьJSON, РезультатЗапроса);
		ЗаписатьHTTPТарифыИнтервалыДоставки(ПараметрыВходногоЗапроса, ЗаписьJSON, РезультатЗапроса);

	ЗаписьJSON.ЗаписатьКонецОбъекта();			
		 
	СтрокаJSON = ЗаписьJSON.Закрыть();   
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
	Возврат Ответ; 
	
КонецФункции	

Процедура ЗаписатьHTTPГрафикДежурств(ПараметрыВходногоЗапроса, ЗаписьJSON, РезультатЗапроса)  
	
	Если ПараметрыВходногоЗапроса.ТипЗапроса <> "getDuty" Тогда 
		Возврат;
	КонецЕсли;   
	
	ЗаписьJSON.ЗаписатьИмяСвойства("data");
	ЗаписьJSON.ЗаписатьНачалоМассива();

		Для Каждого СтрГрафик Из РезультатЗапроса Цикл
			
			ЗаписьJSON.ЗаписатьНачалоОбъекта();
			
				ЗаписьJSON.ЗаписатьИмяСвойства("name");
				ЗаписьJSON.ЗаписатьЗначение(Строка(СтрГрафик.name));
				
				ЗаписьJSON.ЗаписатьИмяСвойства("phone");
				ЗаписьJSON.ЗаписатьЗначение(Строка(СтрГрафик.phone));
				
				ЗаписьJSON.ЗаписатьИмяСвойства("branch");
				ЗаписьJSON.ЗаписатьЗначение(Строка(СтрГрафик.filial));
				
			ЗаписьJSON.ЗаписатьКонецОбъекта();
		КонецЦикла;

	ЗаписьJSON.ЗаписатьКонецМассива();
	
КонецПроцедуры        

Процедура ЗаписатьHTTPТарифыИнтервалыДоставки(ПараметрыВходногоЗапроса, ЗаписьJSON, РезультатЗапроса)  
	
	Если ПараметрыВходногоЗапроса.ТипЗапроса <> "getDeliveryVariants" Тогда 
		Возврат;
	КонецЕсли;   
	
	ЗаписьJSON.ЗаписатьИмяСвойства("data");
	ЗаписьJSON.ЗаписатьНачалоОбъекта();       

		ЗаписьJSON.ЗаписатьИмяСвойства("max_delivery_date");
		ЗаписьJSON.ЗаписатьЗначение(Формат(РезультатЗапроса.МаксимальнаяДатаДоставки, "ДФ=dd.MM.yyyy"));
	
		ЗаписьJSON.ЗаписатьИмяСвойства("tarrifs");
		ЗаписьJSON.ЗаписатьНачалоМассива();

			Для Каждого Тариф Из РезультатЗапроса.Тарифы Цикл
				
				ЗаписьJSON.ЗаписатьНачалоОбъекта();
				
					ЗаписьJSON.ЗаписатьИмяСвойства("id");
					ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(Тариф.Тариф));
				
					ЗаписьJSON.ЗаписатьИмяСвойства("name");
					ЗаписьJSON.ЗаписатьЗначение(Строка(Тариф.Тариф));
					
					ЗаписьJSON.ЗаписатьИмяСвойства("delivery_name");
					ЗаписьJSON.ЗаписатьЗначение(Строка(Тариф.ТипДоставки));

					ЗаписьJSON.ЗаписатьИмяСвойства("price");
					ЗаписьJSON.ЗаписатьЗначение(Тариф.СтоимостьДоставки); 

					ЗаписьJSON.ЗаписатьИмяСвойства("intervals");
					ЗаписьJSON.ЗаписатьНачалоМассива();
						
						ИнтервалыТарифа = РезультатЗапроса.Интервалы.НайтиСтроки(Новый Структура("Тариф", Тариф.Тариф));
						Для Каждого Интервал Из ИнтервалыТарифа Цикл    
							
							ЗаписьJSON.ЗаписатьНачалоОбъекта();
							
								ЗаписьJSON.ЗаписатьИмяСвойства("id");
								ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(Интервал.Интервал));
								
								ЗаписьJSON.ЗаписатьИмяСвойства("name");
								ЗаписьJSON.ЗаписатьЗначение(Строка(Интервал.Интервал)); 
								
								ЗаписьJSON.ЗаписатьИмяСвойства("label");
								ЗаписьJSON.ЗаписатьЗначение(Интервал.ИнтервалНаименованиеНаСайте); 
								
								ЗаписьJSON.ЗаписатьИмяСвойства("active");
								ЗаписьJSON.ЗаписатьЗначение(Интервал.Доступно); 
								
								ЗаписьJSON.ЗаписатьИмяСвойства("from");
								ЗаписьJSON.ЗаписатьЗначение(Час(Интервал.ВремяС)); 
								
								ЗаписьJSON.ЗаписатьИмяСвойства("to");
								ЗаписьJSON.ЗаписатьЗначение(Час(Интервал.ВремяПо)); 
								
								ЗаписьJSON.ЗаписатьИмяСвойства("range");
								ЗаписьJSON.ЗаписатьЗначение((Интервал.ВремяПо - Интервал.ВремяС) / 3600); 
								
								//ЗаписьJSON.ЗаписатьИмяСвойства("week_day");
								//ЗаписьJSON.ЗаписатьЗначение(Интервал.ДеньНедели); 
								
								ЗаписьJSON.ЗаписатьИмяСвойства("unloading");
								ЗаписьJSON.ЗаписатьЗначение(Интервал.ДоступноРазгрузка); 
								
							ЗаписьJSON.ЗаписатьКонецОбъекта();
							
						КонецЦикла;  
						
						ЗаписьJSON.ЗаписатьКонецМассива();
					
				ЗаписьJSON.ЗаписатьКонецОбъекта();
			КонецЦикла;

		ЗаписьJSON.ЗаписатьКонецМассива();
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
КонецПроцедуры

Функция ЗаписатьHTTPОшибку(ПараметрыВходногоЗапроса, ТекстОшибки = "", Статус = 400)
	
	Ответ = Новый HTTPСервисОтвет(Статус);
	Ответ.Заголовки = УстановитьHTTPЗаголовки();		
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("error");
	ЗаписьJSON.ЗаписатьЗначение(Истина);	
	
	ЗаписьJSON.ЗаписатьИмяСвойства("response");
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
		ЗаписьJSON.ЗаписатьИмяСвойства("status");
		ЗаписьJSON.ЗаписатьЗначение(Статус);
		
		ЗаписьJSON.ЗаписатьИмяСвойства("description");
		ЗаписьJSON.ЗаписатьЗначение(ТекстОшибки); 
		
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();  
	
	СтрокаJSON = ЗаписьJSON.Закрыть();    

	Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);	
	Возврат Ответ; 
	
КонецФункции  

Функция УстановитьHTTPЗаголовки()   
	
	 Заголовки = Новый Соответствие;
	 Заголовки.Вставить("Content-Type", "application/json");
	 Заголовки.Вставить("charset", "utf-8");
	 Возврат Заголовки 
	 
 КонецФункции 
 
 #КонецОбласти
 
 #Область ОбработкаВходныхЗапросов  
  
Функция ПолучитьГрафикНаДату(НаДату = Неопределено)
	
	НаДату = ?(ЗначениеЗаполнено(НаДату), НаДату, ТекущаяДата());
	
	График = Новый ТаблицаЗначений();
	График.Колонки.Добавить("duty_date");
	График.Колонки.Добавить("filial");
	График.Колонки.Добавить("name");
	График.Колонки.Добавить("phone");
	
	ОбозначенияФилиалов = Новый ТаблицаЗначений();
	ОбозначенияФилиалов.Колонки.Добавить("Обозначение");
	ОбозначенияФилиалов.Колонки.Добавить("Филиал");
	Стр1 = ОбозначенияФилиалов.Добавить();
	Стр1.Обозначение = "а";
	Стр1.Филиал = "Центральная база";
	Стр2 = ОбозначенияФилиалов.Добавить();
	Стр2.Обозначение = "б";
	Стр2.Филиал = "Выбор";
	Стр3 = ОбозначенияФилиалов.Добавить();
	Стр3.Обозначение = "с";
	Стр3.Филиал = "Барнаул";
	Стр4 = ОбозначенияФилиалов.Добавить();
	Стр4.Обозначение = "д";
	Стр4.Филиал = "Бийск";
	Стр5 = ОбозначенияФилиалов.Добавить();
	Стр5.Обозначение = "з";
	Стр5.Филиал = "Документооборот";     
	Стр6 = ОбозначенияФилиалов.Добавить();
	Стр6.Обозначение = "м";
	Стр6.Филиал = "Майма";
	
	СтруктураГрафикаНаДату = ПолучитьСтруктуруГрафикаНаДату(НаДату);
	
	Если Не ЗначениеЗаполнено(СтруктураГрафикаНаДату) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НаДатуДень = День(НаДату);
		
	Для Каждого ДежурстваСотрудника Из СтруктураГрафикаНаДату Цикл
		
		ОбозначенияДежурств = ДежурстваСотрудника["Примечание" + НаДатуДень];
		СписокФилиалов = "";
		
		Для НомерСимвола = 1 По СтрДлина(ОбозначенияДежурств) Цикл
			
			ТекущийСимвол = Сред(НРег(ОбозначенияДежурств), НомерСимвола, 1);
			ОбозначениеФилиала = ОбозначенияФилиалов.Найти(ТекущийСимвол, "Обозначение");
			
			Если ЗначениеЗаполнено(ОбозначениеФилиала) Тогда
				СписокФилиалов = СписокФилиалов + ?(ЗначениеЗаполнено(СписокФилиалов), ", ", "") + ОбозначениеФилиала.Филиал;	
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(СписокФилиалов) Тогда
		
			СтрГрафик = График.Добавить();
			СтрГрафик.duty_date = Формат(НаДату, "ДФ=dd.MM.yyyy");
			СтрГрафик.filial = СписокФилиалов;
			СтрГрафик.name = ДежурстваСотрудника.Сотрудник;
			
			Телефон = "Нет телефона";
			Телефон = ?(ЗначениеЗаполнено(ДежурстваСотрудника.КорпоративныйТелефон), ДежурстваСотрудника.КорпоративныйТелефон, Телефон);
			Телефон = ?(ЗначениеЗаполнено(ДежурстваСотрудника.ВнутреннийТелефон), ДежурстваСотрудника.ВнутреннийТелефон, Телефон);
			СтрГрафик.phone = Телефон;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат График;
	
КонецФункции

Функция ПолучитьСтруктуруГрафикаНаДату(НаДату)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикДежурствДанныеОВремени.Сотрудник КАК Сотрудник,
		|	ГрафикДежурствДанныеОВремени.Сотрудник.ВнутреннийТелефон КАК ВнутреннийТелефон,
		|	ГрафикДежурствДанныеОВремени.Сотрудник.КорпоративныйТелефон КАК КорпоративныйТелефон,
		|	ГрафикДежурствДанныеОВремени.Примечание1 КАК Примечание1,
		|	ГрафикДежурствДанныеОВремени.Примечание2 КАК Примечание2,
		|	ГрафикДежурствДанныеОВремени.Примечание3 КАК Примечание3,
		|	ГрафикДежурствДанныеОВремени.Примечание4 КАК Примечание4,
		|	ГрафикДежурствДанныеОВремени.Примечание5 КАК Примечание5,
		|	ГрафикДежурствДанныеОВремени.Примечание6 КАК Примечание6,
		|	ГрафикДежурствДанныеОВремени.Примечание7 КАК Примечание7,
		|	ГрафикДежурствДанныеОВремени.Примечание8 КАК Примечание8,
		|	ГрафикДежурствДанныеОВремени.Примечание9 КАК Примечание9,
		|	ГрафикДежурствДанныеОВремени.Примечание10 КАК Примечание10,
		|	ГрафикДежурствДанныеОВремени.Примечание11 КАК Примечание11,
		|	ГрафикДежурствДанныеОВремени.Примечание12 КАК Примечание12,
		|	ГрафикДежурствДанныеОВремени.Примечание13 КАК Примечание13,
		|	ГрафикДежурствДанныеОВремени.Примечание14 КАК Примечание14,
		|	ГрафикДежурствДанныеОВремени.Примечание15 КАК Примечание15,
		|	ГрафикДежурствДанныеОВремени.Примечание16 КАК Примечание16,
		|	ГрафикДежурствДанныеОВремени.Примечание17 КАК Примечание17,
		|	ГрафикДежурствДанныеОВремени.Примечание18 КАК Примечание18,
		|	ГрафикДежурствДанныеОВремени.Примечание19 КАК Примечание19,
		|	ГрафикДежурствДанныеОВремени.Примечание20 КАК Примечание20,
		|	ГрафикДежурствДанныеОВремени.Примечание21 КАК Примечание21,
		|	ГрафикДежурствДанныеОВремени.Примечание22 КАК Примечание22,
		|	ГрафикДежурствДанныеОВремени.Примечание23 КАК Примечание23,
		|	ГрафикДежурствДанныеОВремени.Примечание24 КАК Примечание24,
		|	ГрафикДежурствДанныеОВремени.Примечание25 КАК Примечание25,
		|	ГрафикДежурствДанныеОВремени.Примечание26 КАК Примечание26,
		|	ГрафикДежурствДанныеОВремени.Примечание27 КАК Примечание27,
		|	ГрафикДежурствДанныеОВремени.Примечание28 КАК Примечание28,
		|	ГрафикДежурствДанныеОВремени.Примечание29 КАК Примечание29,
		|	ГрафикДежурствДанныеОВремени.Примечание30 КАК Примечание30,
		|	ГрафикДежурствДанныеОВремени.Примечание31 КАК Примечание31
		|ИЗ
		|	Документ.ГрафикДежурств.ДанныеОВремени КАК ГрафикДежурствДанныеОВремени
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ГрафикДежурствДанныеОВремени.Ссылка.Месяц, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)";
	
	Запрос.УстановитьПараметр("Дата", НаДату);
	
	ТЗРезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если ТЗРезультатЗапроса.Количество() > 0 Тогда
		Возврат ТЗРезультатЗапроса;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

 Функция ПолучитьТарифыИнтервалыДоставки(ДанныеЗапроса)
	 
	РезультатВыполнения = Новый Структура("Результат, Сообщение, Тарифы, Интервалы, МаксимальнаяДатаДоставки", Ложь, "");
	
	Попытка 
		// Расчет объема
		ДанныеЗапроса.Объем = УправлениеЛогистикойСервер.ПолучитьОбъем(ДанныеЗапроса.Товары); 
		ДанныеЗапроса.ОбъемСУчетомСкрутокПоликарбоната = УправлениеЛогистикойСервер.ПолучитьОбъемСУчетомСкрутокПоликарбоната(ДанныеЗапроса.Товары);   	
		ДанныеЗапроса.ОбъемСУчетомСкрутокПоликарбоната = ?(ДанныеЗапроса.ОбъемСУчетомСкрутокПоликарбоната = 0, ДанныеЗапроса.Объем, ДанныеЗапроса.ОбъемСУчетомСкрутокПоликарбоната);	
		Если ДанныеЗапроса.ВидДоставки = Перечисления.ВидыДоставокДоКлиента.Розничная Тогда 
			 ДанныеЗапроса.Объем = ДанныеЗапроса.ОбъемСУчетомСкрутокПоликарбоната;		
		КонецЕсли;
		
		// Получение типов ТС по весу, длине, объему
		ТипыТС = УправлениеЛогистикойСервер.ПолучитьТипыТС(ДанныеЗапроса); 
		Если ТипыТС.Количество() = 0 Тогда
			РезультатВыполнения.Сообщение = "В розничной доставке нет подходящего типа транспорта";
			Возврат РезультатВыполнения;
		КонецЕсли;   
		
		// Получение интервалов доставки по филиалу и виду доставки на дату
        Интервалы = ПолучитьИнтервалы(ДанныеЗапроса);
		Если ТипыТС.Количество() = 0 Тогда
			РезультатВыполнения.Сообщение = "В розничной доставке нет подходящих интервалов доставки";
			Возврат РезультатВыполнения;
		КонецЕсли;   
		
		// Получение тарифов и интервалов тарифов соответсвующих интервалам доставки
		ПолучениеТарифов = ПолучитьТарифы(ТипыТС, Интервалы, ДанныеЗапроса);
		Если ПолучениеТарифов.Тарифы.Количество() = 0 Тогда
			РезультатВыполнения.Сообщение = "В розничной доставке нет подходящего тарифа";
			Возврат РезультатВыполнения;
		КонецЕсли;           
		Если ПолучениеТарифов.Интервалы.Количество() = 0 Тогда
			РезультатВыполнения.Сообщение = "В розничной доставке подходящих интервалов доставки";
			Возврат РезультатВыполнения;
		КонецЕсли;           
		
		ЗаполнитьЗначенияСвойств(РезультатВыполнения, ПолучениеТарифов);
		РезультатВыполнения.МаксимальнаяДатаДоставки = ДанныеЗапроса.МаксимальнаяДатаДоставки;
		РезультатВыполнения.Результат = Истина;
		
	Исключение   
		РезультатВыполнения.Сообщение = СтрШаблон("Ошибка получения тарифов и интервалов: %1", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));		
	КонецПопытки;
	
	Возврат РезультатВыполнения;
	 
КонецФункции	 

#КонецОбласти         

 #Область ВходныеДанные   
 
 Функция ДанныеЗапросаgetDeliveryVariants(ВходныеДанные)   
	 
	РезультатВыполнения = Новый Структура("Результат, ДанныеЗапроса", Ложь, ""); 
	
	Попытка
		ДанныеЗапроса = Новый Структура;  
		
		date = ВходныеДанные.Получить("date");
		Попытка
			ДанныеЗапроса.Вставить("ДатаДоставки", Дата(Число(Прав(date, 4)), Число(Сред(date, 4, 2)), Число(Лев(date, 2))));	
		Исключение                                                              
			РезультатВыполнения.ДанныеЗапроса = "Не определена дата доставки";
			Возврат РезультатВыполнения;
		КонецПопытки;   

		Если ДанныеЗапроса.ДатаДоставки < НачалоДня(ТекущаяДата()) Тогда
			РезультатВыполнения.ДанныеЗапроса = "Дата доставки меньше текущей";
			Возврат РезультатВыполнения;
		КонецЕсли;
		
		ДанныеЗапроса.Вставить("МаксимальнаяДатаДоставки", НачалоДня(ТекущаяДата()) + Константы.ОграничениеПериодаДоставки.Получить() * 24*60*60);
		Если ДанныеЗапроса.ДатаДоставки >= ДанныеЗапроса.МаксимальнаяДатаДоставки Тогда
			РезультатВыполнения.ДанныеЗапроса = СтрШаблон("Максимальная дата доставки %1", Формат(ДанныеЗапроса.МаксимальнаяДатаДоставки, "ДФ=dd.MM.yyyy"));
			Возврат РезультатВыполнения;
		КонецЕсли;
		
		ДанныеЗапроса.Вставить("Адрес", ВходныеДанные.Получить("address"));
		
		coords = ВходныеДанные.Получить("coords");
		ДанныеЗапроса.Вставить("Коодинаты", Новый Структура("Широта, Долгота", coords[0], coords[1]));
		
		zone_id = ВходныеДанные.Получить("zone_id");         
		Попытка
			ДанныеЗапроса.Вставить("ЗонаДоставки", Справочники.ЗоныДоставкиДоКлиента.ПолучитьСсылку(Новый УникальныйИдентификатор(zone_id)));
		Исключение   
			РезультатВыполнения.ДанныеЗапроса = "Не определена зона доставки";    
			Возврат РезультатВыполнения;
		КонецПопытки;
		
		store = ВходныеДанные.Получить("store");
		Попытка
			ДанныеЗапроса.Вставить("Склад", Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(store)));
			ДанныеЗапроса.Вставить("Подразделение", ДанныеЗапроса.Склад.Подразделение);
		Исключение
			РезультатВыполнения.ДанныеЗапроса = "Не определен склад"; 
			Возврат РезультатВыполнения;
		КонецПопытки;                              
		
		delivery_type = ВходныеДанные.Получить("delivery_type");  
		ДанныеЗапроса.Вставить("ВидДоставки");
		Если delivery_type = "retail" Тогда   
			ДанныеЗапроса.ВидДоставки = ПредопределенноеЗначение("Перечисление.ВидыДоставокДоКлиента.Розничная");
		Иначе
			ДанныеЗапроса.ВидДоставки = ПредопределенноеЗначение("Перечисление.ВидыДоставокДоКлиента.СборнаяОРК");
		КонецЕсли;
		
		Товары = Новый ТаблицаЗначений;
		Товары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));     
		КвалификаторЧисла = Новый КвалификаторыЧисла(15,3, ДопустимыйЗнак.Неотрицательный);
		Товары.Колонки.Добавить("КоличествоУпаковок", Новый ОписаниеТипов("Число", КвалификаторЧисла));      
		
		Для Каждого product Из ВходныеДанные.Получить("products") Цикл   
			Товар = Товары.Добавить();    
			
			Товар.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(product.Получить("id")));
			Товар.КоличествоУпаковок = product.Получить("count");
		КонецЦикла;  
		
		ДанныеЗапроса.Вставить("Товары", Товары);
		
		ДанныеЗапроса.Вставить("МаксимальнаяДлина", Число(ВходныеДанные.Получить("max_length")) / 1000 ); // мм в мм
		ДанныеЗапроса.Вставить("Вес",Число(ВходныеДанные.Получить("total_weight")) / 1000); // г в кг        
		
		ДанныеЗапроса.Вставить("Объем");
		ДанныеЗапроса.Вставить("ОбъемСУчетомСкрутокПоликарбоната");
		
		РезультатВыполнения.Результат = Истина;
		РезультатВыполнения.ДанныеЗапроса = ДанныеЗапроса;
	
	Исключение
		РезультатВыполнения.ДанныеЗапроса = СтрШаблон("Ошибка преобразования входного JSON: %1", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));		
	КонецПопытки;
	
	Возврат РезультатВыполнения;
	
КонецФункции	 
 
 #КонецОбласти   
 
 #Область ПолучениеДанныхДоставки              
 
 Функция ПолучитьИнтервалы(Данные)    
	 
	Запрос = Новый Запрос(Справочники.ИнтервалыДоставки.ПолучитьТекстЗапросаДляВыбораИнтервала());
	Запрос.УстановитьПараметр("ДатаОтгрузки",        Данные.ДатаДоставки);
	Запрос.УстановитьПараметр("Подразделение",       Данные.Подразделение);
	Запрос.УстановитьПараметр("ВидДоставки",         Данные.ВидДоставки);
	Запрос.УстановитьПараметр("ДоставкаСРазгрузкой", Истина);
	Запрос.УстановитьПараметр("КорИнтервала",        0);
	Запрос.УстановитьПараметр("ТекДата",             ТекущаяДата());
	
	Если ДеньНедели(Данные.ДатаДоставки) < 6  И Данные.ВидДоставки <> Перечисления.ВидыДоставокДоКлиента.СборнаяОРК Тогда
		Запрос.УстановитьПараметр("ДеньНедели", 0);
	Иначе
		Запрос.УстановитьПараметр("ДеньНедели", ДеньНедели(Данные.ДатаДоставки));
	КонецЕсли;	
	
	Возврат Запрос.Выполнить().Выгрузить();
	 
КонецФункции	 
 
 Функция ПолучитьТарифы(ТипыТС, Интервалы, Данные)
	 
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТипыТС.ТипТС КАК ТипТС
		|ПОМЕСТИТЬ втТипыТС
		|ИЗ
		|	&ТипыТС КАК ТипыТС
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НастройкиТарифов.ТипТС КАК ТипТС,
		|	НастройкиТарифов.Тариф КАК Тариф
		|ПОМЕСТИТЬ втТарифы
		|ИЗ
		|	&НастройкиТарифов КАК НастройкиТарифов 
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГлобальнаяЗона           
		|ПОМЕСТИТЬ втГлобальныеЗоны	
		|ИЗ
		|	РегистрСведений.ГлобальныеЗоныПоЗонамДоставкиДоКлиента
		|ГДЕ
		|	Подразделение = &Подразделение
		|	И Зона = &ЗонаДоставки
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТарифыПеревозчиков.Ссылка КАК Тариф,
		|	ТипыДоставок.Ссылка КАК ТипДоставки
		|ПОМЕСТИТЬ втНастройкиТарифов
		|ИЗ
		|	втТипыТС 
		|	СОЕДИНЕНИЕ втТарифы
		|		ПО втТипыТС.ТипТС = втТарифы.ТипТС
		|	СОЕДИНЕНИЕ Справочник.ТипыТранспортныхСредств КАК ТипыТС
		|		ПО втТарифы.ТипТС = ТипыТС.Ссылка 
		|	СОЕДИНЕНИЕ Справочник.ТарифыПеревозчиков КАК ТарифыПеревозчиков
		|		ПО втТарифы.Тариф = ТарифыПеревозчиков.Ссылка 
		|	СОЕДИНЕНИЕ Справочник.ТипыДоставок КАК ТипыДоставок
		|		ПО ТарифыПеревозчиков.ТипДоставки = ТипыДоставок.Ссылка 
		|	СОЕДИНЕНИЕ втГлобальныеЗоны
		|		ПО ИСТИНА
		|ГДЕ
		|	ВЫБОР
		|		КОГДА втГлобальныеЗоны.ГлобальнаяЗона = ЗНАЧЕНИЕ(Перечисление.ЗоныДоставкиКлиента.Зона2)
		|		ТОГДА ТарифыПеревозчиков.ЗонаДействияТарифа = втГлобальныеЗоны.ГлобальнаяЗона 
		|			ИЛИ ТарифыПеревозчиков.ЗонаДействияТарифа = ЗНАЧЕНИЕ(Перечисление.ЗоныДоставкиКлиента.ПустаяСсылка)
		|       ИНАЧЕ ИСТИНА    
		|	КОНЕЦ
		|	И ТарифыПеревозчиков.Подразделение В
		|		(&Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втНастройкиТарифов.Тариф,
		|	втНастройкиТарифов.ТипДоставки,
		|	СтоимостьДоставкиПоЗонам.СтоимостьДляКлиента КАК СтоимостьДоставки 
		|ПОМЕСТИТЬ втТарифыСтоимость	
		|ИЗ
		|	втНастройкиТарифов
		|	СОЕДИНЕНИЕ РегистрСведений.СтоимостьДоставкиПоЗонам.СрезПоследних(
		|			&ДатаДоставки,
		|			ЗонаДоставки = &ЗонаДоставки
		|			И Филиал = &Подразделение) КАК СтоимостьДоставкиПоЗонам
		|		ПО втНастройкиТарифов.Тариф = СтоимостьДоставкиПоЗонам.Тариф    
		|;       
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Интервалы.Ссылка КАК Интервал,
		|	Интервалы.Наименование КАК ИнтервалНаименование,
		|	Интервалы.НаименованиеНаСайте КАК ИнтервалНаименованиеНаСайте,
		|	Интервалы.ДеньНедели,
		|	Интервалы.ВремяС,
		|	Интервалы.ВремяПо,
		|	Интервалы.МожноВыбрать,
		|	Интервалы.ДоступноНаСегодня,   
		|	Интервалы.МожноВыбратьРазгрузка,
		|	Интервалы.ДоступноНаСегодняСРазгрузкой
		|ПОМЕСТИТЬ втИнтервалы
		|ИЗ
		|	&Интервалы КАК Интервалы 
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ                         
		|	втТарифыСтоимость.Тариф,                     
		|	втТарифыСтоимость.ТипДоставки,   
		|	втТарифыСтоимость.СтоимостьДоставки,
		|	втИнтервалы.Интервал,
		|	втИнтервалы.ИнтервалНаименованиеНаСайте,
		|	втИнтервалы.ДеньНедели,
		|	втИнтервалы.ВремяС,
		|	втИнтервалы.ВремяПо,
		|	втИнтервалы.МожноВыбрать И втИнтервалы.ДоступноНаСегодня > 0 КАК Доступно,   
		|	втИнтервалы.МожноВыбратьРазгрузка И втИнтервалы.ДоступноНаСегодняСРазгрузкой > 0 КАК ДоступноРазгрузка
		|ПОМЕСТИТЬ втИнтервалыТарифов	
		|ИЗ
		|	втТарифыСтоимость 
		|	СОЕДИНЕНИЕ Справочник.ТарифыПеревозчиков.Интервалы КАК ИнтервалыПеревозчиков
		|		ПО втТарифыСтоимость.Тариф = ИнтервалыПеревозчиков.Ссылка                
		|	СОЕДИНЕНИЕ Справочник.ИнтервалыДоставки КАК ИнтервалыДоставки
		|		ПО ИнтервалыПеревозчиков.Интервал = ИнтервалыДоставки.Ссылка
		|		И ИнтервалыДоставки.Подразделение = &Подразделение
		|		И ИнтервалыДоставки.ВидДоставки = &ВидДоставки   
		|	СОЕДИНЕНИЕ втИнтервалы
		|		ПО ИнтервалыПеревозчиков.Интервал = втИнтервалы.Интервал
		|;	                                                                
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТипДоставки,
		|	МИНИМУМ(СтоимостьДоставки) КАК СтоимостьДоставки
		|ПОМЕСТИТЬ
		|	втМинимальнаяСтоимостьПоТипуДоставки
		|ИЗ     
		|	втИнтервалыТарифов  
		|СГРУППИРОВАТЬ ПО
		|	ТипДоставки		
		|;	
		|////////////////////////////////////////////////////////////////////////////////	
		|ВЫБРАТЬ
		|	втМинимальнаяСтоимостьПоТипуДоставки.ТипДоставки,
		|	втМинимальнаяСтоимостьПоТипуДоставки.СтоимостьДоставки,   
		|	МИНИМУМ(Тариф) КАК Тариф
		|ПОМЕСТИТЬ
		|	втМинимальныеТарифы
		|ИЗ     
		|	втМинимальнаяСтоимостьПоТипуДоставки 
		|	СОЕДИНЕНИЕ втИнтервалыТарифов
		|		ПО втМинимальнаяСтоимостьПоТипуДоставки.ТипДоставки = втИнтервалыТарифов.ТипДоставки
		|		И втМинимальнаяСтоимостьПоТипуДоставки.СтоимостьДоставки = втИнтервалыТарифов.СтоимостьДоставки
		|СГРУППИРОВАТЬ ПО
		|	втМинимальнаяСтоимостьПоТипуДоставки.ТипДоставки,
		|	втМинимальнаяСтоимостьПоТипуДоставки.СтоимостьДоставки
		|;	   
		|////////////////////////////////////////////////////////////////////////////////	
		|ВЫБРАТЬ * 
		|ИЗ
		|	втМинимальныеТарифы      
		|УПОРЯДОЧИТЬ ПО
		|	СтоимостьДоставки	
		|;
		|////////////////////////////////////////////////////////////////////////////////	       
		|ВЫБРАТЬ РАЗЛИЧНЫЕ                         
		|	втИнтервалыТарифов.Тариф,                     
		|	втИнтервалыТарифов.Интервал,
		|	втИнтервалыТарифов.ИнтервалНаименованиеНаСайте,
		|	втИнтервалыТарифов.ДеньНедели,
		|	втИнтервалыТарифов.ВремяС,
		|	втИнтервалыТарифов.ВремяПо,
		|	втИнтервалыТарифов.Доступно,   
		|	втИнтервалыТарифов.ДоступноРазгрузка
		|ИЗ 
		|	втИнтервалыТарифов
		|	СОЕДИНЕНИЕ втМинимальныеТарифы
		|		ПО втИнтервалыТарифов.Тариф = втМинимальныеТарифы.Тариф
		|УПОРЯДОЧИТЬ ПО
		|	втИнтервалыТарифов.Тариф,
		|	втИнтервалыТарифов.ВремяС,
		|	втИнтервалыТарифов.ВремяПо,
		|	втИнтервалыТарифов.ДеньНедели";
	
	Запрос.УстановитьПараметр("НастройкиТарифов",	УправлениеЛогистикойСервер.ПолучитьНастройкиАвтоопределения().НастройкиТарифов); 
	Запрос.УстановитьПараметр("ТипыТС", 			ТипыТС); 
	Запрос.УстановитьПараметр("Интервалы", 			Интервалы); 
	Запрос.УстановитьПараметр("Подразделение",		Данные.Подразделение); 
	Запрос.УстановитьПараметр("ДатаДоставки",		Данные.ДатаДоставки);	
	Запрос.УстановитьПараметр("ЗонаДоставки",		Данные.ЗонаДоставки); 
	Запрос.УстановитьПараметр("ВидДоставки",		Данные.ВидДоставки); 
	Запрос.УстановитьПараметр("ПустаяСтрока",		""); 
	
	МассивЗапросов = Запрос.ВыполнитьПакет();       
	
	Возврат Новый Структура("Тарифы, Интервалы", МассивЗапросов[9].Выгрузить(), МассивЗапросов[10].Выгрузить());
	
КонецФункции	
	
 #КонецОбласти
